package Juman::Grammar;
require 5.004_04; # For base pragma.
use strict;
use base qw/ Exporter /;
use vars qw/ @EXPORT_OK $HINSI $BUNRUI $TYPE $FORM /;
@EXPORT_OK = qw/ $HINSI $BUNRUI $TYPE $FORM /;

=head1 NAME

Juman::Grammar - 墒混尸梧辑今および宠脱尸梧辑今

=head1 DESCRIPTION

Juman 墒混尸梧辑今および宠脱尸梧辑今の Perl スクリプト惹ˉ

=head1 VARIABLES

=over 4

=item C<$HINSI>

墒混と墒混戎规の滦炳山(ハッシュ)に滦するリファレンスが呈羌されているˉ

    $HINSI->[0]->{墒混} => 墒混戎规
    $HINSI->[墒混戎规]  => 墒混

=item C<$BUNRUI>

嘿尸梧と嘿尸梧戎规の滦炳山(ハッシュ)に滦するリファレンスが呈羌されてい
るˉ

    $BUNRUI->{墒混}->[0]->{嘿尸梧} => 嘿尸梧戎规
    $BUNRUI->{墒混}->[嘿尸梧戎规]  => 嘿尸梧

=item C<$TYPE>

宠脱房と宠脱房戎规の滦炳山(ハッシュ)に滦するリファレンスが呈羌されてい
るˉ

    $TYPE->[0]->{宠脱房} => 宠脱房戎规
    $TYPE->[宠脱房戎规]  => [ 宠脱房, 宠脱妨, 宠脱妨, ... ]

=item C<$FORM>

宠脱妨と宠脱妨戎规の滦炳山(ハッシュ)に滦するリファレンスが呈羌されてい
るˉ

    $FORM->{宠脱房}->[0]->{宠脱妨} => 宠脱妨戎规
    $FORM->{宠脱房}->[宠脱妨戎规]  => [ 宠脱妨, 胳萨, [粕み胳萨] ]

=back

=cut
$HINSI = [
           {
             '摿庩' => 1,
             '巜帵帉' => 7,
             '愙旜帿' => 14,
             '柤帉' => 6,
             '摦帉' => 2,
             '宍梕帉' => 3,
             '暃帉' => 8,
             '姶摦帉' => 12,
             '敾掕帉' => 4,
             '枹掕媊岅' => 15,
             '愙摢帿' => 13,
             '愙懕帉' => 10,
             '楢懱帉' => 11,
             '彆帉' => 9,
             '彆摦帉' => 5
           },
           '摿庩',
           '摦帉',
           '宍梕帉',
           '敾掕帉',
           '彆摦帉',
           '柤帉',
           '巜帵帉',
           '暃帉',
           '彆帉',
           '愙懕帉',
           '楢懱帉',
           '姶摦帉',
           '愙摢帿',
           '愙旜帿',
           '枹掕媊岅'
         ];
$BUNRUI = {
            '摿庩' => [
                        {
                          '婰崋' => 5,
                          '嬻敀' => 6,
                          '妵屖廔' => 4,
                          '妵屖巒' => 3,
                          '嬪揰' => 1,
                          '撉揰' => 2
                        },
                        '嬪揰',
                        '撉揰',
                        '妵屖巒',
                        '妵屖廔',
                        '婰崋',
                        '嬻敀'
                      ],
            '巜帵帉' => [
                          {
                            '楢懱帉宍懺巜帵帉' => 2,
                            '柤帉宍懺巜帵帉' => 1,
                            '暃帉宍懺巜帵帉' => 3
                          },
                          '柤帉宍懺巜帵帉',
                          '楢懱帉宍懺巜帵帉',
                          '暃帉宍懺巜帵帉'
                        ],
            '柤帉' => [
                        {
                          '悢帉' => 7,
                          '晛捠柤帉' => 1,
                          '慻怐柤' => 6,
                          '僒曄柤帉' => 2,
                          '帪憡柤帉' => 10,
                          '宍幃柤帉' => 8,
                          '恖柤' => 5,
                          '屌桳柤帉' => 3,
                          '暃帉揑柤帉' => 9,
                          '抧柤' => 4
                        },
                        '晛捠柤帉',
                        '僒曄柤帉',
                        '屌桳柤帉',
                        '抧柤',
                        '恖柤',
                        '慻怐柤',
                        '悢帉',
                        '宍幃柤帉',
                        '暃帉揑柤帉',
                        '帪憡柤帉'
                      ],
            '愙旜帿' => [
                          {
                            '宍梕帉惈柤帉愙旜帿' => 6,
                            '宍梕帉惈弎岅愙旜帿' => 5,
                            '柤帉惈摿庩愙旜帿' => 4,
                            '柤帉惈柤帉愙旜帿' => 2,
                            '摦帉惈愙旜帿' => 7,
                            '柤帉惈弎岅愙旜帿' => 1,
                            '柤帉惈柤帉彆悢帿' => 3
                          },
                          '柤帉惈弎岅愙旜帿',
                          '柤帉惈柤帉愙旜帿',
                          '柤帉惈柤帉彆悢帿',
                          '柤帉惈摿庩愙旜帿',
                          '宍梕帉惈弎岅愙旜帿',
                          '宍梕帉惈柤帉愙旜帿',
                          '摦帉惈愙旜帿'
                        ],
            '暃帉' => [
                        {
                          '條懺暃帉' => 1,
                          '掱搙暃帉' => 2,
                          '昡壙暃帉' => 7,
                          '帪惂憡暃帉' => 5,
                          '検暃帉' => 3,
                          '捖弎暃帉' => 6,
                          '昿搙暃帉' => 4,
                          '敪尵暃帉' => 8
                        },
                        '條懺暃帉',
                        '掱搙暃帉',
                        '検暃帉',
                        '昿搙暃帉',
                        '帪惂憡暃帉',
                        '捖弎暃帉',
                        '昡壙暃帉',
                        '敪尵暃帉'
                      ],
            '愙摢帿' => [
                          {
                            '僫宍梕帉愙摢帿' => 4,
                            '僀宍梕帉愙摢帿' => 3,
                            '柤帉愙摢帿' => 1,
                            '摦帉愙摢帿' => 2
                          },
                          '柤帉愙摢帿',
                          '摦帉愙摢帿',
                          '僀宍梕帉愙摢帿',
                          '僫宍梕帉愙摢帿'
                        ],
            '枹掕媊岅' => [
                            {
                              '偦偺懠' => 1,
                              '傾儖僼傽儀僢僩' => 3,
                              '僇僞僇僫' => 2
                            },
                            '偦偺懠',
                            '僇僞僇僫',
                            '傾儖僼傽儀僢僩'
                          ],
            '彆帉' => [
                        {
                          '廔彆帉' => 4,
                          '愙懕彆帉' => 3,
                          '奿彆帉' => 1,
                          '暃彆帉' => 2
                        },
                        '奿彆帉',
                        '暃彆帉',
                        '愙懕彆帉',
                        '廔彆帉'
                      ]
          };
$TYPE = [
          {
            '摦帉惈愙旜帿摼傞宆' => 33,
            '巕壒摦帉僇峴' => 2,
            '僀宍梕帉僀抜' => 19,
            '巕壒摦帉僒峴' => 5,
            '巕壒摦帉僈峴' => 4,
            '僀宍梕帉僀抜摿庩' => 20,
            '摦帉惈愙旜帿傑偡宆' => 31,
            '僇曄摦帉' => 14,
            '僓曄摦帉' => 17,
            '巕壒摦帉儚峴暥岅壒曋宍' => 13,
            '僇曄摦帉棃' => 15,
            '敾掕帉' => 25,
            '巕壒摦帉儅峴' => 9,
            '巕壒摦帉僶峴' => 8,
            '僞儖宍梕帉' => 24,
            '巕壒摦帉僞峴' => 6,
            '巕壒摦帉儔峴僀宍' => 11,
            '僫僲宍梕帉' => 22,
            '巕壒摦帉僫峴' => 7,
            '巕壒摦帉僇峴懀壒曋宍' => 3,
            '彆摦帉偸宆' => 27,
            '僫宍梕帉' => 21,
            '彆摦帉偩傠偆宆' => 28,
            '摦帉惈愙旜帿偆傞宆' => 32,
            '柍妶梡宆' => 26,
            '僀宍梕帉傾僂僆抜' => 18,
            '彆摦帉偔宆' => 30,
            '僒曄摦帉' => 16,
            '巕壒摦帉儚峴' => 12,
            '曣壒摦帉' => 1,
            '彆摦帉偦偆偩宆' => 29,
            '巕壒摦帉儔峴' => 10,
            '僫宍梕帉摿庩' => 23
          },
          [
            '曣壒摦帉',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍',
            '暥岅柦椷宍'
          ],
          [
            '巕壒摦帉僇峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僇峴懀壒曋宍',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僈峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僒峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僞峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僫峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉僶峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉儅峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉儔峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉儔峴僀宍',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '巕壒摦帉儚峴',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍'
          ],
          [
            '巕壒摦帉儚峴暥岅壒曋宍',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍'
          ],
          [
            '僇曄摦帉',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '僇曄摦帉棃',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍'
          ],
          [
            '僒曄摦帉',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍',
            '暥岅婎杮宍',
            '暥岅枹慠宍',
            '暥岅柦椷宍'
          ],
          [
            '僓曄摦帉',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞愙楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '壒曋忦審宍',
            '暥岅婎杮宍',
            '暥岅枹慠宍',
            '暥岅柦椷宍'
          ],
          [
            '僀宍梕帉傾僂僆抜',
            '岅姴',
            '婎杮宍',
            '柦椷宍',
            '婎杮悇検宍',
            '婎杮徣棯悇検宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '僞宯楢梡僠儍宍俀',
            '壒曋忦審宍',
            '壒曋忦審宍俀',
            '暥岅婎杮宍',
            '暥岅枹慠宍',
            '暥岅楢梡宍',
            '暥岅楢懱宍',
            '暥岅柦椷宍'
          ],
          [
            '僀宍梕帉僀抜',
            '岅姴',
            '婎杮宍',
            '柦椷宍',
            '婎杮悇検宍',
            '婎杮徣棯悇検宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '僞宯楢梡僠儍宍俀',
            '壒曋忦審宍',
            '壒曋忦審宍俀',
            '暥岅婎杮宍',
            '暥岅枹慠宍',
            '暥岅楢梡宍',
            '暥岅楢懱宍',
            '暥岅柦椷宍'
          ],
          [
            '僀宍梕帉僀抜摿庩',
            '岅姴',
            '婎杮宍',
            '柦椷宍',
            '婎杮悇検宍',
            '婎杮徣棯悇検宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍',
            '僞宯楢梡僠儍宍',
            '僞宯楢梡僠儍宍俀',
            '壒曋忦審宍',
            '壒曋忦審宍俀',
            '暥岅婎杮宍',
            '暥岅枹慠宍',
            '暥岅楢梡宍',
            '暥岅楢懱宍',
            '暥岅柦椷宍'
          ],
          [
            '僫宍梕帉',
            '岅姴',
            '婎杮宍',
            '僟楍柦椷宍',
            '僟楍婎杮楢懱宍',
            '僟楍婎杮悇検宍',
            '僟楍婎杮徣棯悇検宍',
            '僟楍婎杮忦審宍',
            '僟楍婎杮楢梡宍',
            '僟楍僞宍',
            '僟楍僞宯悇検宍',
            '僟楍僞宯徣棯悇検宍',
            '僟楍僞宯忦審宍',
            '僟楍僞宯楢梡僥宍',
            '僟楍僞宯楢梡僞儕宍',
            '僟楍僞宯楢梡僕儍宍',
            '僟楍暥岅楢懱宍',
            '僟楍暥岅忦審宍',
            '僨傾儖楍婎杮宍',
            '僨傾儖楍柦椷宍',
            '僨傾儖楍婎杮悇検宍',
            '僨傾儖楍婎杮徣棯悇検宍',
            '僨傾儖楍婎杮忦審宍',
            '僨傾儖楍婎杮楢梡宍',
            '僨傾儖楍僞宍',
            '僨傾儖楍僞宯悇検宍',
            '僨傾儖楍僞宯徣棯悇検宍',
            '僨傾儖楍僞宯忦審宍',
            '僨傾儖楍僞宯楢梡僥宍',
            '僨傾儖楍僞宯楢梡僞儕宍',
            '僨僗楍婎杮宍',
            '僨僗楍婎杮悇検宍',
            '僨僗楍婎杮徣棯悇検宍',
            '僨僗楍僞宍',
            '僨僗楍僞宯悇検宍',
            '僨僗楍僞宯徣棯悇検宍',
            '僨僗楍僞宯忦審宍',
            '僨僗楍僞宯楢梡僥宍',
            '僨僗楍僞宯楢梡僞儕宍'
          ],
          [
            '僫僲宍梕帉',
            '岅姴',
            '婎杮宍',
            '僟楍柦椷宍',
            '僟楍婎杮楢懱宍',
            '僟楍摿庩楢懱宍',
            '僟楍婎杮悇検宍',
            '僟楍婎杮徣棯悇検宍',
            '僟楍婎杮忦審宍',
            '僟楍婎杮楢梡宍',
            '僟楍僞宍',
            '僟楍僞宯悇検宍',
            '僟楍僞宯徣棯悇検宍',
            '僟楍僞宯忦審宍',
            '僟楍僞宯楢梡僥宍',
            '僟楍僞宯楢梡僞儕宍',
            '僟楍僞宯楢梡僕儍宍',
            '僟楍暥岅楢懱宍',
            '僟楍暥岅忦審宍',
            '僨傾儖楍婎杮宍',
            '僨傾儖楍柦椷宍',
            '僨傾儖楍婎杮悇検宍',
            '僨傾儖楍婎杮徣棯悇検宍',
            '僨傾儖楍婎杮忦審宍',
            '僨傾儖楍婎杮楢梡宍',
            '僨傾儖楍僞宍',
            '僨傾儖楍僞宯悇検宍',
            '僨傾儖楍僞宯徣棯悇検宍',
            '僨傾儖楍僞宯忦審宍',
            '僨傾儖楍僞宯楢梡僥宍',
            '僨傾儖楍僞宯楢梡僞儕宍',
            '僨僗楍婎杮宍',
            '僨僗楍婎杮悇検宍',
            '僨僗楍婎杮徣棯悇検宍',
            '僨僗楍僞宍',
            '僨僗楍僞宯悇検宍',
            '僨僗楍僞宯徣棯悇検宍',
            '僨僗楍僞宯忦審宍',
            '僨僗楍僞宯楢梡僥宍',
            '僨僗楍僞宯楢梡僞儕宍'
          ],
          [
            '僫宍梕帉摿庩',
            '岅姴',
            '婎杮宍',
            '僟楍柦椷宍',
            '僟楍婎杮楢懱宍',
            '僟楍摿庩楢懱宍',
            '僟楍婎杮悇検宍',
            '僟楍婎杮徣棯悇検宍',
            '僟楍婎杮忦審宍',
            '僟楍婎杮楢梡宍',
            '僟楍摿庩楢梡宍',
            '僟楍僞宍',
            '僟楍僞宯悇検宍',
            '僟楍僞宯徣棯悇検宍',
            '僟楍僞宯忦審宍',
            '僟楍僞宯楢梡僥宍',
            '僟楍僞宯楢梡僞儕宍',
            '僟楍僞宯楢梡僕儍宍',
            '僟楍暥岅楢懱宍',
            '僟楍暥岅忦審宍',
            '僨傾儖楍婎杮宍',
            '僨傾儖楍柦椷宍',
            '僨傾儖楍婎杮悇検宍',
            '僨傾儖楍婎杮徣棯悇検宍',
            '僨傾儖楍婎杮忦審宍',
            '僨傾儖楍婎杮楢梡宍',
            '僨傾儖楍僞宍',
            '僨傾儖楍僞宯悇検宍',
            '僨傾儖楍僞宯徣棯悇検宍',
            '僨傾儖楍僞宯忦審宍',
            '僨傾儖楍僞宯楢梡僥宍',
            '僨傾儖楍僞宯楢梡僞儕宍',
            '僨僗楍婎杮宍',
            '僨僗楍婎杮悇検宍',
            '僨僗楍婎杮徣棯悇検宍',
            '僨僗楍僞宍',
            '僨僗楍僞宯悇検宍',
            '僨僗楍僞宯徣棯悇検宍',
            '僨僗楍僞宯忦審宍',
            '僨僗楍僞宯楢梡僥宍',
            '僨僗楍僞宯楢梡僞儕宍'
          ],
          [
            '僞儖宍梕帉',
            '岅姴',
            '婎杮宍',
            '婎杮楢梡宍'
          ],
          [
            '敾掕帉',
            '岅姴',
            '婎杮宍',
            '僟楍柦椷宍',
            '僟楍婎杮楢懱宍',
            '僟楍摿庩楢懱宍',
            '僟楍婎杮悇検宍',
            '僟楍婎杮徣棯悇検宍',
            '僟楍婎杮忦審宍',
            '僟楍僞宍',
            '僟楍僞宯悇検宍',
            '僟楍僞宯徣棯悇検宍',
            '僟楍僞宯忦審宍',
            '僟楍僞宯楢梡僥宍',
            '僟楍僞宯楢梡僞儕宍',
            '僟楍僞宯楢梡僕儍宍',
            '僨傾儖楍婎杮宍',
            '僨傾儖楍柦椷宍',
            '僨傾儖楍婎杮悇検宍',
            '僨傾儖楍婎杮徣棯悇検宍',
            '僨傾儖楍婎杮忦審宍',
            '僨傾儖楍婎杮楢梡宍',
            '僨傾儖楍僞宍',
            '僨傾儖楍僞宯悇検宍',
            '僨傾儖楍僞宯徣棯悇検宍',
            '僨傾儖楍僞宯忦審宍',
            '僨傾儖楍僞宯楢梡僥宍',
            '僨傾儖楍僞宯楢梡僞儕宍',
            '僨僗楍婎杮宍',
            '僨僗楍婎杮悇検宍',
            '僨僗楍婎杮徣棯悇検宍',
            '僨僗楍僞宍',
            '僨僗楍僞宯悇検宍',
            '僨僗楍僞宯徣棯悇検宍',
            '僨僗楍僞宯忦審宍',
            '僨僗楍僞宯楢梡僥宍',
            '僨僗楍僞宯楢梡僞儕宍'
          ],
          [
            '柍妶梡宆',
            '岅姴',
            '婎杮宍'
          ],
          [
            '彆摦帉偸宆',
            '岅姴',
            '婎杮宍',
            '婎杮忦審宍',
            '婎杮楢梡宍',
            '婎杮悇検宍',
            '婎杮徣棯悇検宍',
            '僞宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '壒曋婎杮宍',
            '壒曋悇検宍',
            '壒曋徣棯悇検宍',
            '暥岅楢懱宍',
            '暥岅忦審宍',
            '暥岅壒曋忦審宍'
          ],
          [
            '彆摦帉偩傠偆宆',
            '岅姴',
            '婎杮宍',
            '僟楍婎杮徣棯悇検宍',
            '僟楍婎杮忦審宍',
            '僨傾儖楍婎杮悇検宍',
            '僨傾儖楍婎杮徣棯悇検宍',
            '僨僗楍婎杮悇検宍',
            '僨僗楍婎杮徣棯悇検宍'
          ],
          [
            '彆摦帉偦偆偩宆',
            '岅姴',
            '婎杮宍',
            '僟楍僞宯楢梡僥宍',
            '僨傾儖楍婎杮宍',
            '僨僗楍婎杮宍'
          ],
          [
            '彆摦帉偔宆',
            '岅姴',
            '婎杮宍',
            '婎杮楢梡宍',
            '暥岅楢懱宍'
          ],
          [
            '摦帉惈愙旜帿傑偡宆',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '堄巙宍',
            '徣棯堄巙宍',
            '柦椷宍',
            '僞宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍'
          ],
          [
            '摦帉惈愙旜帿偆傞宆',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '婎杮忦審宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍'
          ],
          [
            '摦帉惈愙旜帿摼傞宆',
            '岅姴',
            '婎杮宍',
            '枹慠宍',
            '婎杮忦審宍',
            '僞宍',
            '僞宯悇検宍',
            '僞宯徣棯悇検宍',
            '僞宯忦審宍',
            '僞宯楢梡僥宍',
            '僞宯楢梡僞儕宍'
          ]
        ];
$FORM = {
          '摦帉惈愙旜帿摼傞宆' => [
                                    {
                                      '僞宯楢梡僥宍' => 9,
                                      '僞宯徣棯悇検宍' => 7,
                                      '僞宯悇検宍' => 6,
                                      '僞宍' => 5,
                                      '婎杮忦審宍' => 4,
                                      '枹慠宍' => 3,
                                      '婎杮宍' => 2,
                                      '岅姴' => 1,
                                      '僞宯楢梡僞儕宍' => 10,
                                      '僞宯忦審宍' => 8
                                    },
                                    [
                                      '岅姴',
                                      '*',
                                      '*'
                                    ],
                                    [
                                      '婎杮宍',
                                      '摼傞',
                                      '偆傞'
                                    ],
                                    [
                                      '枹慠宍',
                                      '摼',
                                      '偊'
                                    ],
                                    [
                                      '婎杮忦審宍',
                                      '摼傟偽',
                                      '偆傟偽'
                                    ],
                                    [
                                      '僞宍',
                                      '摼偨',
                                      '偊偨'
                                    ],
                                    [
                                      '僞宯悇検宍',
                                      '摼偨傠偆',
                                      '偊偨傠偆'
                                    ],
                                    [
                                      '僞宯徣棯悇検宍',
                                      '摼偨傠',
                                      '偊偨傠'
                                    ],
                                    [
                                      '僞宯忦審宍',
                                      '摼偨傜',
                                      '偊偨傜'
                                    ],
                                    [
                                      '僞宯楢梡僥宍',
                                      '摼偰',
                                      '偊偰'
                                    ],
                                    [
                                      '僞宯楢梡僞儕宍',
                                      '摼偨傝',
                                      '偊偨傝'
                                    ]
                                  ],
          '巕壒摦帉僇峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偔'
                              ],
                              [
                                '枹慠宍',
                                '偐'
                              ],
                              [
                                '堄巙宍',
                                '偙偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偙'
                              ],
                              [
                                '柦椷宍',
                                '偗'
                              ],
                              [
                                '婎杮忦審宍',
                                '偗偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偒'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偄'
                              ],
                              [
                                '僞宍',
                                '偄偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偄偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偄偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偄偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偄偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偄偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偄偪傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偒傖'
                              ]
                            ],
          '僀宍梕帉僀抜' => [
                              {
                                '暥岅枹慠宍' => 19,
                                '壒曋忦審宍俀' => 17,
                                '僞宯楢梡僠儍宍' => 14,
                                '婎杮悇検宍' => 4,
                                '暥岅楢梡宍' => 20,
                                '僞宍' => 8,
                                '暥岅楢懱宍' => 21,
                                '婎杮楢梡宍' => 7,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 13,
                                '婎杮徣棯悇検宍' => 5,
                                '柦椷宍' => 3,
                                '僞宯徣棯悇検宍' => 10,
                                '僞宯楢梡僥宍' => 12,
                                '僞宯悇検宍' => 9,
                                '婎杮忦審宍' => 6,
                                '婎杮宍' => 2,
                                '僞宯楢梡僠儍宍俀' => 15,
                                '壒曋忦審宍' => 16,
                                '暥岅柦椷宍' => 22,
                                '暥岅婎杮宍' => 18,
                                '僞宯忦審宍' => 11
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偄'
                              ],
                              [
                                '柦椷宍',
                                '偐傟'
                              ],
                              [
                                '婎杮悇検宍',
                                '偐傠偆'
                              ],
                              [
                                '婎杮徣棯悇検宍',
                                '偐傠'
                              ],
                              [
                                '婎杮忦審宍',
                                '偗傟偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偔'
                              ],
                              [
                                '僞宍',
                                '偐偭偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偐偭偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偐偭偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偐偭偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偔偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偐偭偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偔偪傖'
                              ],
                              [
                                '僞宯楢梡僠儍宍俀',
                                '偔偭偪傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偗傝傖'
                              ],
                              [
                                '壒曋忦審宍俀',
                                '偒傖'
                              ],
                              [
                                '暥岅婎杮宍',
                                '*'
                              ],
                              [
                                '暥岅枹慠宍',
                                '偐傜'
                              ],
                              [
                                '暥岅楢梡宍',
                                '傘偆'
                              ],
                              [
                                '暥岅楢懱宍',
                                '偒'
                              ],
                              [
                                '暥岅柦椷宍',
                                '偐傟'
                              ]
                            ],
          '巕壒摦帉僒峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偡'
                              ],
                              [
                                '枹慠宍',
                                '偝'
                              ],
                              [
                                '堄巙宍',
                                '偦偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偦'
                              ],
                              [
                                '柦椷宍',
                                '偣'
                              ],
                              [
                                '婎杮忦審宍',
                                '偣偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偟'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偟'
                              ],
                              [
                                '僞宍',
                                '偟偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偟偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偟偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偟偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偟偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偟偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偟偪傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偟傖'
                              ]
                            ],
          '巕壒摦帉僈峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偖'
                              ],
                              [
                                '枹慠宍',
                                '偑'
                              ],
                              [
                                '堄巙宍',
                                '偛偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偛'
                              ],
                              [
                                '柦椷宍',
                                '偘'
                              ],
                              [
                                '婎杮忦審宍',
                                '偘偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偓'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偄'
                              ],
                              [
                                '僞宍',
                                '偄偩'
                              ],
                              [
                                '僞宯悇検宍',
                                '偄偩傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偄偩傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偄偩傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偄偱'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偄偩傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偄偠傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偓傖'
                              ]
                            ],
          '僀宍梕帉僀抜摿庩' => [
                                  {
                                    '暥岅枹慠宍' => 19,
                                    '壒曋忦審宍俀' => 17,
                                    '僞宯楢梡僠儍宍' => 14,
                                    '婎杮悇検宍' => 4,
                                    '暥岅楢梡宍' => 20,
                                    '僞宍' => 8,
                                    '暥岅楢懱宍' => 21,
                                    '婎杮楢梡宍' => 7,
                                    '岅姴' => 1,
                                    '僞宯楢梡僞儕宍' => 13,
                                    '婎杮徣棯悇検宍' => 5,
                                    '柦椷宍' => 3,
                                    '僞宯徣棯悇検宍' => 10,
                                    '僞宯楢梡僥宍' => 12,
                                    '僞宯悇検宍' => 9,
                                    '婎杮忦審宍' => 6,
                                    '婎杮宍' => 2,
                                    '僞宯楢梡僠儍宍俀' => 15,
                                    '壒曋忦審宍' => 16,
                                    '暥岅柦椷宍' => 22,
                                    '暥岅婎杮宍' => 18,
                                    '僞宯忦審宍' => 11
                                  },
                                  [
                                    '岅姴',
                                    '*'
                                  ],
                                  [
                                    '婎杮宍',
                                    '偄'
                                  ],
                                  [
                                    '柦椷宍',
                                    '偐傟'
                                  ],
                                  [
                                    '婎杮悇検宍',
                                    '偐傠偆'
                                  ],
                                  [
                                    '婎杮徣棯悇検宍',
                                    '偐傠'
                                  ],
                                  [
                                    '婎杮忦審宍',
                                    '偗傟偽'
                                  ],
                                  [
                                    '婎杮楢梡宍',
                                    '偔'
                                  ],
                                  [
                                    '僞宍',
                                    '偐偭偨'
                                  ],
                                  [
                                    '僞宯悇検宍',
                                    '偐偭偨傠偆'
                                  ],
                                  [
                                    '僞宯徣棯悇検宍',
                                    '偐偭偨傠'
                                  ],
                                  [
                                    '僞宯忦審宍',
                                    '偐偭偨傜'
                                  ],
                                  [
                                    '僞宯楢梡僥宍',
                                    '偔偰'
                                  ],
                                  [
                                    '僞宯楢梡僞儕宍',
                                    '偐偭偨傝'
                                  ],
                                  [
                                    '僞宯楢梡僠儍宍',
                                    '偔偪傖'
                                  ],
                                  [
                                    '僞宯楢梡僠儍宍俀',
                                    '偔偭偪傖'
                                  ],
                                  [
                                    '壒曋忦審宍',
                                    '偗傝傖'
                                  ],
                                  [
                                    '壒曋忦審宍俀',
                                    '偒傖'
                                  ],
                                  [
                                    '暥岅婎杮宍',
                                    '偟'
                                  ],
                                  [
                                    '暥岅枹慠宍',
                                    '偐傜'
                                  ],
                                  [
                                    '暥岅楢梡宍',
                                    '傘偆'
                                  ],
                                  [
                                    '暥岅楢懱宍',
                                    '偒'
                                  ],
                                  [
                                    '暥岅柦椷宍',
                                    '偐傟'
                                  ]
                                ],
          '摦帉惈愙旜帿傑偡宆' => [
                                    {
                                      '僞宯楢梡僥宍' => 9,
                                      '徣棯堄巙宍' => 5,
                                      '僞宍' => 7,
                                      '枹慠宍' => 3,
                                      '婎杮宍' => 2,
                                      '岅姴' => 1,
                                      '僞宯楢梡僞儕宍' => 10,
                                      '堄巙宍' => 4,
                                      '柦椷宍' => 6,
                                      '僞宯忦審宍' => 8
                                    },
                                    [
                                      '岅姴',
                                      '*'
                                    ],
                                    [
                                      '婎杮宍',
                                      '傑偡'
                                    ],
                                    [
                                      '枹慠宍',
                                      '傑偣'
                                    ],
                                    [
                                      '堄巙宍',
                                      '傑偟傚偆'
                                    ],
                                    [
                                      '徣棯堄巙宍',
                                      '傑偟傚'
                                    ],
                                    [
                                      '柦椷宍',
                                      '傑偣'
                                    ],
                                    [
                                      '僞宍',
                                      '傑偟偨'
                                    ],
                                    [
                                      '僞宯忦審宍',
                                      '傑偟偨傜'
                                    ],
                                    [
                                      '僞宯楢梡僥宍',
                                      '傑偟偰'
                                    ],
                                    [
                                      '僞宯楢梡僞儕宍',
                                      '傑偟偨傝'
                                    ]
                                  ],
          '僇曄摦帉' => [
                          {
                            '僞宯楢梡僠儍宍' => 16,
                            '僞宍' => 10,
                            '婎杮楢梡宍' => 8,
                            '岅姴' => 1,
                            '僞宯楢梡僞儕宍' => 15,
                            '柦椷宍' => 6,
                            '僞宯徣棯悇検宍' => 12,
                            '僞宯楢梡僥宍' => 14,
                            '僞愙楢梡宍' => 9,
                            '徣棯堄巙宍' => 5,
                            '僞宯悇検宍' => 11,
                            '婎杮忦審宍' => 7,
                            '枹慠宍' => 3,
                            '婎杮宍' => 2,
                            '壒曋忦審宍' => 17,
                            '堄巙宍' => 4,
                            '僞宯忦審宍' => 13
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '偔傞'
                          ],
                          [
                            '枹慠宍',
                            '偙'
                          ],
                          [
                            '堄巙宍',
                            '偙傛偆'
                          ],
                          [
                            '徣棯堄巙宍',
                            '偙傛'
                          ],
                          [
                            '柦椷宍',
                            '偙偄'
                          ],
                          [
                            '婎杮忦審宍',
                            '偔傟偽'
                          ],
                          [
                            '婎杮楢梡宍',
                            '偒'
                          ],
                          [
                            '僞愙楢梡宍',
                            '偒'
                          ],
                          [
                            '僞宍',
                            '偒偨'
                          ],
                          [
                            '僞宯悇検宍',
                            '偒偨傠偆'
                          ],
                          [
                            '僞宯徣棯悇検宍',
                            '偒偨傠'
                          ],
                          [
                            '僞宯忦審宍',
                            '偒偨傜'
                          ],
                          [
                            '僞宯楢梡僥宍',
                            '偒偰'
                          ],
                          [
                            '僞宯楢梡僞儕宍',
                            '偒偨傝'
                          ],
                          [
                            '僞宯楢梡僠儍宍',
                            '偒偪傖'
                          ],
                          [
                            '壒曋忦審宍',
                            '偔傝傖'
                          ]
                        ],
          '僓曄摦帉' => [
                          {
                            '暥岅枹慠宍' => 19,
                            '僞宯楢梡僠儍宍' => 16,
                            '僞宍' => 10,
                            '婎杮楢梡宍' => 8,
                            '岅姴' => 1,
                            '僞宯楢梡僞儕宍' => 15,
                            '柦椷宍' => 6,
                            '僞宯徣棯悇検宍' => 12,
                            '僞宯楢梡僥宍' => 14,
                            '僞愙楢梡宍' => 9,
                            '徣棯堄巙宍' => 5,
                            '僞宯悇検宍' => 11,
                            '婎杮忦審宍' => 7,
                            '枹慠宍' => 3,
                            '婎杮宍' => 2,
                            '壒曋忦審宍' => 17,
                            '暥岅柦椷宍' => 20,
                            '堄巙宍' => 4,
                            '暥岅婎杮宍' => 18,
                            '僞宯忦審宍' => 13
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '偢傞'
                          ],
                          [
                            '枹慠宍',
                            '偞'
                          ],
                          [
                            '堄巙宍',
                            '偠傛偆'
                          ],
                          [
                            '徣棯堄巙宍',
                            '偠傛'
                          ],
                          [
                            '柦椷宍',
                            '偤傛'
                          ],
                          [
                            '婎杮忦審宍',
                            '偢傟偽'
                          ],
                          [
                            '婎杮楢梡宍',
                            '偠'
                          ],
                          [
                            '僞愙楢梡宍',
                            '偠'
                          ],
                          [
                            '僞宍',
                            '偠偨'
                          ],
                          [
                            '僞宯悇検宍',
                            '偠偨傠偆'
                          ],
                          [
                            '僞宯徣棯悇検宍',
                            '偠偨傠'
                          ],
                          [
                            '僞宯忦審宍',
                            '偠偨傜'
                          ],
                          [
                            '僞宯楢梡僥宍',
                            '偠偰'
                          ],
                          [
                            '僞宯楢梡僞儕宍',
                            '偠偨傝'
                          ],
                          [
                            '僞宯楢梡僠儍宍',
                            '偠偪傖'
                          ],
                          [
                            '壒曋忦審宍',
                            '偢傝傖'
                          ],
                          [
                            '暥岅婎杮宍',
                            '偢'
                          ],
                          [
                            '暥岅枹慠宍',
                            '偤'
                          ],
                          [
                            '暥岅柦椷宍',
                            '偠傠'
                          ]
                        ],
          '巕壒摦帉儚峴暥岅壒曋宍' => [
                                        {
                                          '僞宯楢梡僠儍宍' => 16,
                                          '僞宍' => 10,
                                          '婎杮楢梡宍' => 8,
                                          '岅姴' => 1,
                                          '僞宯楢梡僞儕宍' => 15,
                                          '柦椷宍' => 6,
                                          '僞宯徣棯悇検宍' => 12,
                                          '僞宯楢梡僥宍' => 14,
                                          '僞愙楢梡宍' => 9,
                                          '徣棯堄巙宍' => 5,
                                          '僞宯悇検宍' => 11,
                                          '婎杮忦審宍' => 7,
                                          '枹慠宍' => 3,
                                          '婎杮宍' => 2,
                                          '堄巙宍' => 4,
                                          '僞宯忦審宍' => 13
                                        },
                                        [
                                          '岅姴',
                                          '*'
                                        ],
                                        [
                                          '婎杮宍',
                                          '偆'
                                        ],
                                        [
                                          '枹慠宍',
                                          '傢'
                                        ],
                                        [
                                          '堄巙宍',
                                          '偍偆'
                                        ],
                                        [
                                          '徣棯堄巙宍',
                                          '偍'
                                        ],
                                        [
                                          '柦椷宍',
                                          '偊'
                                        ],
                                        [
                                          '婎杮忦審宍',
                                          '偊偽'
                                        ],
                                        [
                                          '婎杮楢梡宍',
                                          '偄'
                                        ],
                                        [
                                          '僞愙楢梡宍',
                                          '偆'
                                        ],
                                        [
                                          '僞宍',
                                          '偆偨'
                                        ],
                                        [
                                          '僞宯悇検宍',
                                          '偆偨傠偆'
                                        ],
                                        [
                                          '僞宯徣棯悇検宍',
                                          '偆偨傠'
                                        ],
                                        [
                                          '僞宯忦審宍',
                                          '偆偨傜'
                                        ],
                                        [
                                          '僞宯楢梡僥宍',
                                          '偆偰'
                                        ],
                                        [
                                          '僞宯楢梡僞儕宍',
                                          '偆偨傝'
                                        ],
                                        [
                                          '僞宯楢梡僠儍宍',
                                          '偆偪傖'
                                        ]
                                      ],
          '僇曄摦帉棃' => [
                            {
                              '僞宯楢梡僠儍宍' => 16,
                              '僞宍' => 10,
                              '婎杮楢梡宍' => 8,
                              '岅姴' => 1,
                              '僞宯楢梡僞儕宍' => 15,
                              '柦椷宍' => 6,
                              '僞宯徣棯悇検宍' => 12,
                              '僞宯楢梡僥宍' => 14,
                              '僞愙楢梡宍' => 9,
                              '徣棯堄巙宍' => 5,
                              '僞宯悇検宍' => 11,
                              '婎杮忦審宍' => 7,
                              '枹慠宍' => 3,
                              '婎杮宍' => 2,
                              '壒曋忦審宍' => 17,
                              '堄巙宍' => 4,
                              '僞宯忦審宍' => 13
                            },
                            [
                              '岅姴',
                              '*',
                              '*'
                            ],
                            [
                              '婎杮宍',
                              '棃傞',
                              '偔傞'
                            ],
                            [
                              '枹慠宍',
                              '棃',
                              '偙'
                            ],
                            [
                              '堄巙宍',
                              '棃傛偆',
                              '偙傛偆'
                            ],
                            [
                              '徣棯堄巙宍',
                              '棃傛',
                              '偙傛'
                            ],
                            [
                              '柦椷宍',
                              '棃偄',
                              '偙偄'
                            ],
                            [
                              '婎杮忦審宍',
                              '棃傟偽',
                              '偔傟偽'
                            ],
                            [
                              '婎杮楢梡宍',
                              '棃',
                              '偒'
                            ],
                            [
                              '僞愙楢梡宍',
                              '棃',
                              '偒'
                            ],
                            [
                              '僞宍',
                              '棃偨',
                              '偒偨'
                            ],
                            [
                              '僞宯悇検宍',
                              '棃偨傠偆',
                              '偒偨傠偆'
                            ],
                            [
                              '僞宯徣棯悇検宍',
                              '棃偨傠',
                              '偒偨傠'
                            ],
                            [
                              '僞宯忦審宍',
                              '棃偨傜',
                              '偒偨傜'
                            ],
                            [
                              '僞宯楢梡僥宍',
                              '棃偰',
                              '偒偰'
                            ],
                            [
                              '僞宯楢梡僞儕宍',
                              '棃偨傝',
                              '偒偨傝'
                            ],
                            [
                              '僞宯楢梡僠儍宍',
                              '棃偪傖',
                              '偒偪傖'
                            ],
                            [
                              '壒曋忦審宍',
                              '棃傝傖',
                              '偔傝傖'
                            ]
                          ],
          '敾掕帉' => [
                        {
                          '僨傾儖楍僞宯楢梡僥宍' => 26,
                          '僟楍僞宯楢梡僥宍' => 13,
                          '僟楍僞宯悇検宍' => 10,
                          '僟楍柦椷宍' => 3,
                          '岅姴' => 1,
                          '僟楍婎杮忦審宍' => 8,
                          '僨僗楍婎杮徣棯悇検宍' => 30,
                          '僨傾儖楍婎杮悇検宍' => 18,
                          '僨傾儖楍僞宯忦審宍' => 25,
                          '僨傾儖楍婎杮徣棯悇検宍' => 19,
                          '僨傾儖楍柦椷宍' => 17,
                          '僨僗楍僞宯楢梡僥宍' => 35,
                          '僨僗楍僞宯忦審宍' => 34,
                          '僟楍僞宯楢梡僞儕宍' => 14,
                          '僨僗楍僞宯徣棯悇検宍' => 33,
                          '僨僗楍婎杮宍' => 28,
                          '僨僗楍僞宯悇検宍' => 32,
                          '僟楍僞宯忦審宍' => 12,
                          '僟楍摿庩楢懱宍' => 5,
                          '僟楍僞宍' => 9,
                          '僨傾儖楍僞宍' => 22,
                          '僨僗楍僞宯楢梡僞儕宍' => 36,
                          '僟楍婎杮悇検宍' => 6,
                          '僨傾儖楍僞宯楢梡僞儕宍' => 27,
                          '僨傾儖楍婎杮宍' => 16,
                          '僨僗楍僞宍' => 31,
                          '僟楍婎杮徣棯悇検宍' => 7,
                          '僟楍僞宯徣棯悇検宍' => 11,
                          '僟楍婎杮楢懱宍' => 4,
                          '僨傾儖楍婎杮楢梡宍' => 21,
                          '僨傾儖楍僞宯悇検宍' => 23,
                          '僟楍僞宯楢梡僕儍宍' => 15,
                          '婎杮宍' => 2,
                          '僨傾儖楍婎杮忦審宍' => 20,
                          '僨傾儖楍僞宯徣棯悇検宍' => 24,
                          '僨僗楍婎杮悇検宍' => 29
                        },
                        [
                          '岅姴',
                          '*'
                        ],
                        [
                          '婎杮宍',
                          '偩'
                        ],
                        [
                          '僟楍柦椷宍',
                          '側傟'
                        ],
                        [
                          '僟楍婎杮楢懱宍',
                          '側'
                        ],
                        [
                          '僟楍摿庩楢懱宍',
                          '偺'
                        ],
                        [
                          '僟楍婎杮悇検宍',
                          '偩傠偆'
                        ],
                        [
                          '僟楍婎杮徣棯悇検宍',
                          '偩傠'
                        ],
                        [
                          '僟楍婎杮忦審宍',
                          '側傜偽'
                        ],
                        [
                          '僟楍僞宍',
                          '偩偭偨'
                        ],
                        [
                          '僟楍僞宯悇検宍',
                          '偩偭偨傠偆'
                        ],
                        [
                          '僟楍僞宯徣棯悇検宍',
                          '偩偭偨傠'
                        ],
                        [
                          '僟楍僞宯忦審宍',
                          '偩偭偨傜'
                        ],
                        [
                          '僟楍僞宯楢梡僥宍',
                          '偱'
                        ],
                        [
                          '僟楍僞宯楢梡僞儕宍',
                          '偩偭偨傝'
                        ],
                        [
                          '僟楍僞宯楢梡僕儍宍',
                          '偠傖'
                        ],
                        [
                          '僨傾儖楍婎杮宍',
                          '偱偁傞'
                        ],
                        [
                          '僨傾儖楍柦椷宍',
                          '偱偁傟'
                        ],
                        [
                          '僨傾儖楍婎杮悇検宍',
                          '偱偁傠偆'
                        ],
                        [
                          '僨傾儖楍婎杮徣棯悇検宍',
                          '偱偁傠'
                        ],
                        [
                          '僨傾儖楍婎杮忦審宍',
                          '偱偁傟偽'
                        ],
                        [
                          '僨傾儖楍婎杮楢梡宍',
                          '偱偁傝'
                        ],
                        [
                          '僨傾儖楍僞宍',
                          '偱偁偭偨'
                        ],
                        [
                          '僨傾儖楍僞宯悇検宍',
                          '偱偁偭偨傠偆'
                        ],
                        [
                          '僨傾儖楍僞宯徣棯悇検宍',
                          '偱偁偭偨傠'
                        ],
                        [
                          '僨傾儖楍僞宯忦審宍',
                          '偱偁偭偨傜'
                        ],
                        [
                          '僨傾儖楍僞宯楢梡僥宍',
                          '偱偁偭偰'
                        ],
                        [
                          '僨傾儖楍僞宯楢梡僞儕宍',
                          '偱偁偭偨傝'
                        ],
                        [
                          '僨僗楍婎杮宍',
                          '偱偡'
                        ],
                        [
                          '僨僗楍婎杮悇検宍',
                          '偱偟傚偆'
                        ],
                        [
                          '僨僗楍婎杮徣棯悇検宍',
                          '偱偟傚'
                        ],
                        [
                          '僨僗楍僞宍',
                          '偱偟偨'
                        ],
                        [
                          '僨僗楍僞宯悇検宍',
                          '偱偟偨傠偆'
                        ],
                        [
                          '僨僗楍僞宯徣棯悇検宍',
                          '偱偟偨傠'
                        ],
                        [
                          '僨僗楍僞宯忦審宍',
                          '偱偟偨傜'
                        ],
                        [
                          '僨僗楍僞宯楢梡僥宍',
                          '偱偟偰'
                        ],
                        [
                          '僨僗楍僞宯楢梡僞儕宍',
                          '偱偟偨傝'
                        ]
                      ],
          '巕壒摦帉儅峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '傓'
                              ],
                              [
                                '枹慠宍',
                                '傑'
                              ],
                              [
                                '堄巙宍',
                                '傕偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '傕'
                              ],
                              [
                                '柦椷宍',
                                '傔'
                              ],
                              [
                                '婎杮忦審宍',
                                '傔偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '傒'
                              ],
                              [
                                '僞愙楢梡宍',
                                '傫'
                              ],
                              [
                                '僞宍',
                                '傫偩'
                              ],
                              [
                                '僞宯悇検宍',
                                '傫偩傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '傫偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '傫偩傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '傫偱'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '傫偩傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '傫偠傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '傒傖'
                              ]
                            ],
          '巕壒摦帉僶峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '傇'
                              ],
                              [
                                '枹慠宍',
                                '偽'
                              ],
                              [
                                '堄巙宍',
                                '傏偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '傏'
                              ],
                              [
                                '柦椷宍',
                                '傋'
                              ],
                              [
                                '婎杮忦審宍',
                                '傋偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '傃'
                              ],
                              [
                                '僞愙楢梡宍',
                                '傫'
                              ],
                              [
                                '僞宍',
                                '傫偩'
                              ],
                              [
                                '僞宯悇検宍',
                                '傫偩傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '傫偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '傫偩傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '傫偱'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '傫偩傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '傫偠傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '傃傖'
                              ]
                            ],
          '僞儖宍梕帉' => [
                            {
                              '婎杮楢梡宍' => 3,
                              '岅姴' => 1,
                              '婎杮宍' => 2
                            },
                            [
                              '岅姴',
                              '*'
                            ],
                            [
                              '婎杮宍',
                              '偨傞'
                            ],
                            [
                              '婎杮楢梡宍',
                              '偲'
                            ]
                          ],
          '巕壒摦帉僞峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偮'
                              ],
                              [
                                '枹慠宍',
                                '偨'
                              ],
                              [
                                '堄巙宍',
                                '偲偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偲'
                              ],
                              [
                                '柦椷宍',
                                '偰'
                              ],
                              [
                                '婎杮忦審宍',
                                '偰偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偪'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偭'
                              ],
                              [
                                '僞宍',
                                '偭偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偭偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偭偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偭偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偭偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偭偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偭偪傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偪傖'
                              ]
                            ],
          '巕壒摦帉儔峴僀宍' => [
                                  {
                                    '僞宯楢梡僠儍宍' => 16,
                                    '僞宍' => 10,
                                    '婎杮楢梡宍' => 8,
                                    '岅姴' => 1,
                                    '僞宯楢梡僞儕宍' => 15,
                                    '柦椷宍' => 6,
                                    '僞宯徣棯悇検宍' => 12,
                                    '僞宯楢梡僥宍' => 14,
                                    '僞愙楢梡宍' => 9,
                                    '徣棯堄巙宍' => 5,
                                    '僞宯悇検宍' => 11,
                                    '婎杮忦審宍' => 7,
                                    '枹慠宍' => 3,
                                    '婎杮宍' => 2,
                                    '壒曋忦審宍' => 17,
                                    '堄巙宍' => 4,
                                    '僞宯忦審宍' => 13
                                  },
                                  [
                                    '岅姴',
                                    '*'
                                  ],
                                  [
                                    '婎杮宍',
                                    '傞'
                                  ],
                                  [
                                    '枹慠宍',
                                    '傜'
                                  ],
                                  [
                                    '堄巙宍',
                                    '傠偆'
                                  ],
                                  [
                                    '徣棯堄巙宍',
                                    '傠'
                                  ],
                                  [
                                    '柦椷宍',
                                    '偄'
                                  ],
                                  [
                                    '婎杮忦審宍',
                                    '傟偽'
                                  ],
                                  [
                                    '婎杮楢梡宍',
                                    '傝'
                                  ],
                                  [
                                    '僞愙楢梡宍',
                                    '偭'
                                  ],
                                  [
                                    '僞宍',
                                    '偭偨'
                                  ],
                                  [
                                    '僞宯悇検宍',
                                    '偭偨傠偆'
                                  ],
                                  [
                                    '僞宯徣棯悇検宍',
                                    '偭偨傠'
                                  ],
                                  [
                                    '僞宯忦審宍',
                                    '偭偨傜'
                                  ],
                                  [
                                    '僞宯楢梡僥宍',
                                    '偭偰'
                                  ],
                                  [
                                    '僞宯楢梡僞儕宍',
                                    '偭偨傝'
                                  ],
                                  [
                                    '僞宯楢梡僠儍宍',
                                    '偭偪傖'
                                  ],
                                  [
                                    '壒曋忦審宍',
                                    '傝傖'
                                  ]
                                ],
          '僫僲宍梕帉' => [
                            {
                              '僟楍婎杮楢梡宍' => 9,
                              '僟楍暥岅楢懱宍' => 17,
                              '僨傾儖楍僞宯楢梡僥宍' => 29,
                              '僟楍僞宯楢梡僥宍' => 14,
                              '僟楍僞宯悇検宍' => 11,
                              '僟楍柦椷宍' => 3,
                              '僟楍暥岅忦審宍' => 18,
                              '岅姴' => 1,
                              '僟楍婎杮忦審宍' => 8,
                              '僨僗楍婎杮徣棯悇検宍' => 33,
                              '僨傾儖楍婎杮悇検宍' => 21,
                              '僨傾儖楍僞宯忦審宍' => 28,
                              '僨傾儖楍婎杮徣棯悇検宍' => 22,
                              '僨傾儖楍柦椷宍' => 20,
                              '僨僗楍僞宯楢梡僥宍' => 38,
                              '僨僗楍僞宯忦審宍' => 37,
                              '僟楍僞宯楢梡僞儕宍' => 15,
                              '僨僗楍僞宯徣棯悇検宍' => 36,
                              '僨僗楍婎杮宍' => 31,
                              '僨僗楍僞宯悇検宍' => 35,
                              '僟楍僞宯忦審宍' => 13,
                              '僟楍摿庩楢懱宍' => 5,
                              '僟楍僞宍' => 10,
                              '僨傾儖楍僞宍' => 25,
                              '僨僗楍僞宯楢梡僞儕宍' => 39,
                              '僟楍婎杮悇検宍' => 6,
                              '僨傾儖楍僞宯楢梡僞儕宍' => 30,
                              '僨僗楍僞宍' => 34,
                              '僨傾儖楍婎杮宍' => 19,
                              '僟楍婎杮徣棯悇検宍' => 7,
                              '僟楍僞宯徣棯悇検宍' => 12,
                              '僟楍婎杮楢懱宍' => 4,
                              '僨傾儖楍婎杮楢梡宍' => 24,
                              '僨傾儖楍僞宯悇検宍' => 26,
                              '僟楍僞宯楢梡僕儍宍' => 16,
                              '婎杮宍' => 2,
                              '僨傾儖楍婎杮忦審宍' => 23,
                              '僨傾儖楍僞宯徣棯悇検宍' => 27,
                              '僨僗楍婎杮悇検宍' => 32
                            },
                            [
                              '岅姴',
                              '*'
                            ],
                            [
                              '婎杮宍',
                              '偩'
                            ],
                            [
                              '僟楍柦椷宍',
                              '側傟'
                            ],
                            [
                              '僟楍婎杮楢懱宍',
                              '側'
                            ],
                            [
                              '僟楍摿庩楢懱宍',
                              '偺'
                            ],
                            [
                              '僟楍婎杮悇検宍',
                              '偩傠偆'
                            ],
                            [
                              '僟楍婎杮徣棯悇検宍',
                              '偩傠'
                            ],
                            [
                              '僟楍婎杮忦審宍',
                              '側傜偽'
                            ],
                            [
                              '僟楍婎杮楢梡宍',
                              '偵'
                            ],
                            [
                              '僟楍僞宍',
                              '偩偭偨'
                            ],
                            [
                              '僟楍僞宯悇検宍',
                              '偩偭偨傠偆'
                            ],
                            [
                              '僟楍僞宯徣棯悇検宍',
                              '偩偭偨傠'
                            ],
                            [
                              '僟楍僞宯忦審宍',
                              '偩偭偨傜'
                            ],
                            [
                              '僟楍僞宯楢梡僥宍',
                              '偱'
                            ],
                            [
                              '僟楍僞宯楢梡僞儕宍',
                              '偩偭偨傝'
                            ],
                            [
                              '僟楍僞宯楢梡僕儍宍',
                              '偠傖'
                            ],
                            [
                              '僟楍暥岅楢懱宍',
                              '側傞'
                            ],
                            [
                              '僟楍暥岅忦審宍',
                              '側傟偽'
                            ],
                            [
                              '僨傾儖楍婎杮宍',
                              '偱偁傞'
                            ],
                            [
                              '僨傾儖楍柦椷宍',
                              '偱偁傟'
                            ],
                            [
                              '僨傾儖楍婎杮悇検宍',
                              '偱偁傠偆'
                            ],
                            [
                              '僨傾儖楍婎杮徣棯悇検宍',
                              '偱偁傠'
                            ],
                            [
                              '僨傾儖楍婎杮忦審宍',
                              '偱偁傟偽'
                            ],
                            [
                              '僨傾儖楍婎杮楢梡宍',
                              '偱偁傝'
                            ],
                            [
                              '僨傾儖楍僞宍',
                              '偱偁偭偨'
                            ],
                            [
                              '僨傾儖楍僞宯悇検宍',
                              '偱偁偭偨傠偆'
                            ],
                            [
                              '僨傾儖楍僞宯徣棯悇検宍',
                              '偱偁偭偨傠'
                            ],
                            [
                              '僨傾儖楍僞宯忦審宍',
                              '偱偁偭偨傜'
                            ],
                            [
                              '僨傾儖楍僞宯楢梡僥宍',
                              '偱偁偭偰'
                            ],
                            [
                              '僨傾儖楍僞宯楢梡僞儕宍',
                              '偱偁偭偨傝'
                            ],
                            [
                              '僨僗楍婎杮宍',
                              '偱偡'
                            ],
                            [
                              '僨僗楍婎杮悇検宍',
                              '偱偟傚偆'
                            ],
                            [
                              '僨僗楍婎杮徣棯悇検宍',
                              '偱偟傚'
                            ],
                            [
                              '僨僗楍僞宍',
                              '偱偟偨'
                            ],
                            [
                              '僨僗楍僞宯悇検宍',
                              '偱偟偨傠偆'
                            ],
                            [
                              '僨僗楍僞宯徣棯悇検宍',
                              '偱偟偨傠'
                            ],
                            [
                              '僨僗楍僞宯忦審宍',
                              '偱偟偨傜'
                            ],
                            [
                              '僨僗楍僞宯楢梡僥宍',
                              '偱偟偰'
                            ],
                            [
                              '僨僗楍僞宯楢梡僞儕宍',
                              '偱偟偨傝'
                            ]
                          ],
          '巕壒摦帉僫峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偸'
                              ],
                              [
                                '枹慠宍',
                                '側'
                              ],
                              [
                                '堄巙宍',
                                '偺偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偺'
                              ],
                              [
                                '柦椷宍',
                                '偹'
                              ],
                              [
                                '婎杮忦審宍',
                                '偹偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偵'
                              ],
                              [
                                '僞愙楢梡宍',
                                '傫'
                              ],
                              [
                                '僞宍',
                                '傫偩'
                              ],
                              [
                                '僞宯悇検宍',
                                '傫偩傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '傫偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '傫偩傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '傫偱'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '傫偩傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '傫偠傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '偵傖'
                              ]
                            ],
          '巕壒摦帉僇峴懀壒曋宍' => [
                                      {
                                        '僞宯楢梡僠儍宍' => 16,
                                        '僞宍' => 10,
                                        '婎杮楢梡宍' => 8,
                                        '岅姴' => 1,
                                        '僞宯楢梡僞儕宍' => 15,
                                        '柦椷宍' => 6,
                                        '僞宯徣棯悇検宍' => 12,
                                        '僞宯楢梡僥宍' => 14,
                                        '僞愙楢梡宍' => 9,
                                        '徣棯堄巙宍' => 5,
                                        '僞宯悇検宍' => 11,
                                        '婎杮忦審宍' => 7,
                                        '枹慠宍' => 3,
                                        '婎杮宍' => 2,
                                        '壒曋忦審宍' => 17,
                                        '堄巙宍' => 4,
                                        '僞宯忦審宍' => 13
                                      },
                                      [
                                        '岅姴',
                                        '*'
                                      ],
                                      [
                                        '婎杮宍',
                                        '偔'
                                      ],
                                      [
                                        '枹慠宍',
                                        '偐'
                                      ],
                                      [
                                        '堄巙宍',
                                        '偙偆'
                                      ],
                                      [
                                        '徣棯堄巙宍',
                                        '偙'
                                      ],
                                      [
                                        '柦椷宍',
                                        '偗'
                                      ],
                                      [
                                        '婎杮忦審宍',
                                        '偗偽'
                                      ],
                                      [
                                        '婎杮楢梡宍',
                                        '偒'
                                      ],
                                      [
                                        '僞愙楢梡宍',
                                        '偭'
                                      ],
                                      [
                                        '僞宍',
                                        '偭偨'
                                      ],
                                      [
                                        '僞宯悇検宍',
                                        '偭偨傠偆'
                                      ],
                                      [
                                        '僞宯徣棯悇検宍',
                                        '偭偨傠'
                                      ],
                                      [
                                        '僞宯忦審宍',
                                        '偭偨傜'
                                      ],
                                      [
                                        '僞宯楢梡僥宍',
                                        '偭偰'
                                      ],
                                      [
                                        '僞宯楢梡僞儕宍',
                                        '偭偨傝'
                                      ],
                                      [
                                        '僞宯楢梡僠儍宍',
                                        '偭偪傖'
                                      ],
                                      [
                                        '壒曋忦審宍',
                                        '偒傖'
                                      ]
                                    ],
          '彆摦帉偸宆' => [
                            {
                              '壒曋徣棯悇検宍' => 14,
                              '僞宯徣棯悇検宍' => 11,
                              '僞宯楢梡僥宍' => 9,
                              '僞宯悇検宍' => 10,
                              '婎杮悇検宍' => 5,
                              '壒曋悇検宍' => 13,
                              '壒曋婎杮宍' => 12,
                              '僞宍' => 7,
                              '婎杮忦審宍' => 3,
                              '暥岅楢懱宍' => 15,
                              '婎杮宍' => 2,
                              '婎杮楢梡宍' => 4,
                              '岅姴' => 1,
                              '暥岅忦審宍' => 16,
                              '婎杮徣棯悇検宍' => 6,
                              '暥岅壒曋忦審宍' => 17,
                              '僞宯忦審宍' => 8
                            },
                            [
                              '岅姴',
                              '*'
                            ],
                            [
                              '婎杮宍',
                              '偸'
                            ],
                            [
                              '婎杮忦審宍',
                              '偹偽'
                            ],
                            [
                              '婎杮楢梡宍',
                              '偢'
                            ],
                            [
                              '婎杮悇検宍',
                              '偸偩傠偆'
                            ],
                            [
                              '婎杮徣棯悇検宍',
                              '偸偩傠'
                            ],
                            [
                              '僞宍',
                              '側傫偩'
                            ],
                            [
                              '僞宯忦審宍',
                              '側傫偩傜'
                            ],
                            [
                              '僞宯楢梡僥宍',
                              '側偄偱'
                            ],
                            [
                              '僞宯悇検宍',
                              '側傫偩傠偆'
                            ],
                            [
                              '僞宯徣棯悇検宍',
                              '側傫偩傠'
                            ],
                            [
                              '壒曋婎杮宍',
                              '傫'
                            ],
                            [
                              '壒曋悇検宍',
                              '傫偩傠偆'
                            ],
                            [
                              '壒曋徣棯悇検宍',
                              '傫偩傠'
                            ],
                            [
                              '暥岅楢懱宍',
                              '偞傞'
                            ],
                            [
                              '暥岅忦審宍',
                              '偞傟偽'
                            ],
                            [
                              '暥岅壒曋忦審宍',
                              '偢傫偽'
                            ]
                          ],
          '僫宍梕帉' => [
                          {
                            '僟楍婎杮楢梡宍' => 8,
                            '僟楍暥岅楢懱宍' => 16,
                            '僨傾儖楍僞宯楢梡僥宍' => 28,
                            '僟楍僞宯楢梡僥宍' => 13,
                            '僟楍僞宯悇検宍' => 10,
                            '僟楍柦椷宍' => 3,
                            '僟楍暥岅忦審宍' => 17,
                            '岅姴' => 1,
                            '僟楍婎杮忦審宍' => 7,
                            '僨僗楍婎杮徣棯悇検宍' => 32,
                            '僨傾儖楍婎杮悇検宍' => 20,
                            '僨傾儖楍僞宯忦審宍' => 27,
                            '僨傾儖楍婎杮徣棯悇検宍' => 21,
                            '僨傾儖楍柦椷宍' => 19,
                            '僨僗楍僞宯楢梡僥宍' => 37,
                            '僨僗楍僞宯忦審宍' => 36,
                            '僟楍僞宯楢梡僞儕宍' => 14,
                            '僨僗楍僞宯徣棯悇検宍' => 35,
                            '僨僗楍婎杮宍' => 30,
                            '僨僗楍僞宯悇検宍' => 34,
                            '僟楍僞宯忦審宍' => 12,
                            '僟楍僞宍' => 9,
                            '僨傾儖楍僞宍' => 24,
                            '僨僗楍僞宯楢梡僞儕宍' => 38,
                            '僟楍婎杮悇検宍' => 5,
                            '僨傾儖楍僞宯楢梡僞儕宍' => 29,
                            '僨僗楍僞宍' => 33,
                            '僨傾儖楍婎杮宍' => 18,
                            '僟楍婎杮徣棯悇検宍' => 6,
                            '僟楍僞宯徣棯悇検宍' => 11,
                            '僟楍婎杮楢懱宍' => 4,
                            '僨傾儖楍婎杮楢梡宍' => 23,
                            '僨傾儖楍僞宯悇検宍' => 25,
                            '僟楍僞宯楢梡僕儍宍' => 15,
                            '婎杮宍' => 2,
                            '僨傾儖楍婎杮忦審宍' => 22,
                            '僨傾儖楍僞宯徣棯悇検宍' => 26,
                            '僨僗楍婎杮悇検宍' => 31
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '偩'
                          ],
                          [
                            '僟楍柦椷宍',
                            '側傟'
                          ],
                          [
                            '僟楍婎杮楢懱宍',
                            '側'
                          ],
                          [
                            '僟楍婎杮悇検宍',
                            '偩傠偆'
                          ],
                          [
                            '僟楍婎杮徣棯悇検宍',
                            '偩傠'
                          ],
                          [
                            '僟楍婎杮忦審宍',
                            '側傜偽'
                          ],
                          [
                            '僟楍婎杮楢梡宍',
                            '偵'
                          ],
                          [
                            '僟楍僞宍',
                            '偩偭偨'
                          ],
                          [
                            '僟楍僞宯悇検宍',
                            '偩偭偨傠偆'
                          ],
                          [
                            '僟楍僞宯徣棯悇検宍',
                            '偩偭偨傠'
                          ],
                          [
                            '僟楍僞宯忦審宍',
                            '偩偭偨傜'
                          ],
                          [
                            '僟楍僞宯楢梡僥宍',
                            '偱'
                          ],
                          [
                            '僟楍僞宯楢梡僞儕宍',
                            '偩偭偨傝'
                          ],
                          [
                            '僟楍僞宯楢梡僕儍宍',
                            '偠傖'
                          ],
                          [
                            '僟楍暥岅楢懱宍',
                            '側傞'
                          ],
                          [
                            '僟楍暥岅忦審宍',
                            '側傟偽'
                          ],
                          [
                            '僨傾儖楍婎杮宍',
                            '偱偁傞'
                          ],
                          [
                            '僨傾儖楍柦椷宍',
                            '偱偁傟'
                          ],
                          [
                            '僨傾儖楍婎杮悇検宍',
                            '偱偁傠偆'
                          ],
                          [
                            '僨傾儖楍婎杮徣棯悇検宍',
                            '偱偁傠'
                          ],
                          [
                            '僨傾儖楍婎杮忦審宍',
                            '偱偁傟偽'
                          ],
                          [
                            '僨傾儖楍婎杮楢梡宍',
                            '偱偁傝'
                          ],
                          [
                            '僨傾儖楍僞宍',
                            '偱偁偭偨'
                          ],
                          [
                            '僨傾儖楍僞宯悇検宍',
                            '偱偁偭偨傠偆'
                          ],
                          [
                            '僨傾儖楍僞宯徣棯悇検宍',
                            '偱偁偭偨傠'
                          ],
                          [
                            '僨傾儖楍僞宯忦審宍',
                            '偱偁偭偨傜'
                          ],
                          [
                            '僨傾儖楍僞宯楢梡僥宍',
                            '偱偁偭偰'
                          ],
                          [
                            '僨傾儖楍僞宯楢梡僞儕宍',
                            '偱偁偭偨傝'
                          ],
                          [
                            '僨僗楍婎杮宍',
                            '偱偡'
                          ],
                          [
                            '僨僗楍婎杮悇検宍',
                            '偱偟傚偆'
                          ],
                          [
                            '僨僗楍婎杮徣棯悇検宍',
                            '偱偟傚'
                          ],
                          [
                            '僨僗楍僞宍',
                            '偱偟偨'
                          ],
                          [
                            '僨僗楍僞宯悇検宍',
                            '偱偟偨傠偆'
                          ],
                          [
                            '僨僗楍僞宯徣棯悇検宍',
                            '偱偟偨傠'
                          ],
                          [
                            '僨僗楍僞宯忦審宍',
                            '偱偟偨傜'
                          ],
                          [
                            '僨僗楍僞宯楢梡僥宍',
                            '偱偟偰'
                          ],
                          [
                            '僨僗楍僞宯楢梡僞儕宍',
                            '偱偟偨傝'
                          ]
                        ],
          '彆摦帉偩傠偆宆' => [
                                {
                                  '僟楍婎杮徣棯悇検宍' => 3,
                                  '婎杮宍' => 2,
                                  '岅姴' => 1,
                                  '僟楍婎杮忦審宍' => 4,
                                  '僨傾儖楍婎杮悇検宍' => 5,
                                  '僨僗楍婎杮徣棯悇検宍' => 8,
                                  '僨傾儖楍婎杮徣棯悇検宍' => 6,
                                  '僨僗楍婎杮悇検宍' => 7
                                },
                                [
                                  '岅姴',
                                  '*'
                                ],
                                [
                                  '婎杮宍',
                                  '偩傠偆'
                                ],
                                [
                                  '僟楍婎杮徣棯悇検宍',
                                  '偩傠'
                                ],
                                [
                                  '僟楍婎杮忦審宍',
                                  '側傜偽'
                                ],
                                [
                                  '僨傾儖楍婎杮悇検宍',
                                  '偱偁傠偆'
                                ],
                                [
                                  '僨傾儖楍婎杮徣棯悇検宍',
                                  '偱偁傠'
                                ],
                                [
                                  '僨僗楍婎杮悇検宍',
                                  '偱偟傚偆'
                                ],
                                [
                                  '僨僗楍婎杮徣棯悇検宍',
                                  '偱偟傚'
                                ]
                              ],
          '摦帉惈愙旜帿偆傞宆' => [
                                    {
                                      '僞宯楢梡僥宍' => 9,
                                      '僞宯徣棯悇検宍' => 7,
                                      '僞宯悇検宍' => 6,
                                      '僞宍' => 5,
                                      '婎杮忦審宍' => 4,
                                      '枹慠宍' => 3,
                                      '婎杮宍' => 2,
                                      '岅姴' => 1,
                                      '僞宯楢梡僞儕宍' => 10,
                                      '僞宯忦審宍' => 8
                                    },
                                    [
                                      '岅姴',
                                      '*'
                                    ],
                                    [
                                      '婎杮宍',
                                      '偆傞'
                                    ],
                                    [
                                      '枹慠宍',
                                      '偊'
                                    ],
                                    [
                                      '婎杮忦審宍',
                                      '偆傟偽'
                                    ],
                                    [
                                      '僞宍',
                                      '偊偨'
                                    ],
                                    [
                                      '僞宯悇検宍',
                                      '偊偨傠偆'
                                    ],
                                    [
                                      '僞宯徣棯悇検宍',
                                      '偊偨傠'
                                    ],
                                    [
                                      '僞宯忦審宍',
                                      '偊偨傜'
                                    ],
                                    [
                                      '僞宯楢梡僥宍',
                                      '偊偰'
                                    ],
                                    [
                                      '僞宯楢梡僞儕宍',
                                      '偊偨傝'
                                    ]
                                  ],
          '柍妶梡宆' => [
                          {
                            '岅姴' => 1,
                            '婎杮宍' => 2
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '*'
                          ]
                        ],
          '僀宍梕帉傾僂僆抜' => [
                                  {
                                    '暥岅枹慠宍' => 19,
                                    '壒曋忦審宍俀' => 17,
                                    '僞宯楢梡僠儍宍' => 14,
                                    '婎杮悇検宍' => 4,
                                    '暥岅楢梡宍' => 20,
                                    '僞宍' => 8,
                                    '暥岅楢懱宍' => 21,
                                    '婎杮楢梡宍' => 7,
                                    '岅姴' => 1,
                                    '僞宯楢梡僞儕宍' => 13,
                                    '婎杮徣棯悇検宍' => 5,
                                    '柦椷宍' => 3,
                                    '僞宯徣棯悇検宍' => 10,
                                    '僞宯楢梡僥宍' => 12,
                                    '僞宯悇検宍' => 9,
                                    '婎杮忦審宍' => 6,
                                    '婎杮宍' => 2,
                                    '僞宯楢梡僠儍宍俀' => 15,
                                    '壒曋忦審宍' => 16,
                                    '暥岅柦椷宍' => 22,
                                    '暥岅婎杮宍' => 18,
                                    '僞宯忦審宍' => 11
                                  },
                                  [
                                    '岅姴',
                                    '*'
                                  ],
                                  [
                                    '婎杮宍',
                                    '偄'
                                  ],
                                  [
                                    '柦椷宍',
                                    '偐傟'
                                  ],
                                  [
                                    '婎杮悇検宍',
                                    '偐傠偆'
                                  ],
                                  [
                                    '婎杮徣棯悇検宍',
                                    '偐傠'
                                  ],
                                  [
                                    '婎杮忦審宍',
                                    '偗傟偽'
                                  ],
                                  [
                                    '婎杮楢梡宍',
                                    '偔'
                                  ],
                                  [
                                    '僞宍',
                                    '偐偭偨'
                                  ],
                                  [
                                    '僞宯悇検宍',
                                    '偐偭偨傠偆'
                                  ],
                                  [
                                    '僞宯徣棯悇検宍',
                                    '偐偭偨傠'
                                  ],
                                  [
                                    '僞宯忦審宍',
                                    '偐偭偨傜'
                                  ],
                                  [
                                    '僞宯楢梡僥宍',
                                    '偔偰'
                                  ],
                                  [
                                    '僞宯楢梡僞儕宍',
                                    '偐偭偨傝'
                                  ],
                                  [
                                    '僞宯楢梡僠儍宍',
                                    '偔偪傖'
                                  ],
                                  [
                                    '僞宯楢梡僠儍宍俀',
                                    '偔偭偪傖'
                                  ],
                                  [
                                    '壒曋忦審宍',
                                    '偗傝傖'
                                  ],
                                  [
                                    '壒曋忦審宍俀',
                                    '偒傖'
                                  ],
                                  [
                                    '暥岅婎杮宍',
                                    '偟'
                                  ],
                                  [
                                    '暥岅枹慠宍',
                                    '偐傜'
                                  ],
                                  [
                                    '暥岅楢梡宍',
                                    '偆'
                                  ],
                                  [
                                    '暥岅楢懱宍',
                                    '偒'
                                  ],
                                  [
                                    '暥岅柦椷宍',
                                    '偐傟'
                                  ]
                                ],
          '彆摦帉偔宆' => [
                            {
                              '婎杮楢梡宍' => 3,
                              '岅姴' => 1,
                              '暥岅楢懱宍' => 4,
                              '婎杮宍' => 2
                            },
                            [
                              '岅姴',
                              '*'
                            ],
                            [
                              '婎杮宍',
                              '偟'
                            ],
                            [
                              '婎杮楢梡宍',
                              '偔'
                            ],
                            [
                              '暥岅楢懱宍',
                              '偒'
                            ]
                          ],
          '僒曄摦帉' => [
                          {
                            '暥岅枹慠宍' => 19,
                            '僞宯楢梡僠儍宍' => 16,
                            '僞宍' => 10,
                            '婎杮楢梡宍' => 8,
                            '岅姴' => 1,
                            '僞宯楢梡僞儕宍' => 15,
                            '柦椷宍' => 6,
                            '僞宯徣棯悇検宍' => 12,
                            '僞宯楢梡僥宍' => 14,
                            '僞愙楢梡宍' => 9,
                            '徣棯堄巙宍' => 5,
                            '僞宯悇検宍' => 11,
                            '婎杮忦審宍' => 7,
                            '枹慠宍' => 3,
                            '婎杮宍' => 2,
                            '壒曋忦審宍' => 17,
                            '暥岅柦椷宍' => 20,
                            '堄巙宍' => 4,
                            '暥岅婎杮宍' => 18,
                            '僞宯忦審宍' => 13
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '偡傞'
                          ],
                          [
                            '枹慠宍',
                            '偝'
                          ],
                          [
                            '堄巙宍',
                            '偟傛偆'
                          ],
                          [
                            '徣棯堄巙宍',
                            '偟傛'
                          ],
                          [
                            '柦椷宍',
                            '偟傠'
                          ],
                          [
                            '婎杮忦審宍',
                            '偡傟偽'
                          ],
                          [
                            '婎杮楢梡宍',
                            '偟'
                          ],
                          [
                            '僞愙楢梡宍',
                            '偟'
                          ],
                          [
                            '僞宍',
                            '偟偨'
                          ],
                          [
                            '僞宯悇検宍',
                            '偟偨傠偆'
                          ],
                          [
                            '僞宯徣棯悇検宍',
                            '偟偨傠'
                          ],
                          [
                            '僞宯忦審宍',
                            '偟偨傜'
                          ],
                          [
                            '僞宯楢梡僥宍',
                            '偟偰'
                          ],
                          [
                            '僞宯楢梡僞儕宍',
                            '偟偨傝'
                          ],
                          [
                            '僞宯楢梡僠儍宍',
                            '偟偪傖'
                          ],
                          [
                            '壒曋忦審宍',
                            '偡傝傖'
                          ],
                          [
                            '暥岅婎杮宍',
                            '偡'
                          ],
                          [
                            '暥岅枹慠宍',
                            '偣'
                          ],
                          [
                            '暥岅柦椷宍',
                            '偣傛'
                          ]
                        ],
          '巕壒摦帉儚峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偆'
                              ],
                              [
                                '枹慠宍',
                                '傢'
                              ],
                              [
                                '堄巙宍',
                                '偍偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '偍'
                              ],
                              [
                                '柦椷宍',
                                '偊'
                              ],
                              [
                                '婎杮忦審宍',
                                '偊偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '偄'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偭'
                              ],
                              [
                                '僞宍',
                                '偭偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偭偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偭偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偭偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偭偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偭偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偭偪傖'
                              ]
                            ],
          '曣壒摦帉' => [
                          {
                            '僞宯楢梡僠儍宍' => 16,
                            '僞宍' => 10,
                            '婎杮楢梡宍' => 8,
                            '岅姴' => 1,
                            '僞宯楢梡僞儕宍' => 15,
                            '柦椷宍' => 6,
                            '僞宯徣棯悇検宍' => 12,
                            '僞宯楢梡僥宍' => 14,
                            '僞愙楢梡宍' => 9,
                            '徣棯堄巙宍' => 5,
                            '僞宯悇検宍' => 11,
                            '婎杮忦審宍' => 7,
                            '枹慠宍' => 3,
                            '婎杮宍' => 2,
                            '壒曋忦審宍' => 17,
                            '暥岅柦椷宍' => 18,
                            '堄巙宍' => 4,
                            '僞宯忦審宍' => 13
                          },
                          [
                            '岅姴',
                            '*'
                          ],
                          [
                            '婎杮宍',
                            '傞'
                          ],
                          [
                            '枹慠宍',
                            '*'
                          ],
                          [
                            '堄巙宍',
                            '傛偆'
                          ],
                          [
                            '徣棯堄巙宍',
                            '傛'
                          ],
                          [
                            '柦椷宍',
                            '傠'
                          ],
                          [
                            '婎杮忦審宍',
                            '傟偽'
                          ],
                          [
                            '婎杮楢梡宍',
                            '*'
                          ],
                          [
                            '僞愙楢梡宍',
                            '*'
                          ],
                          [
                            '僞宍',
                            '偨'
                          ],
                          [
                            '僞宯悇検宍',
                            '偨傠偆'
                          ],
                          [
                            '僞宯徣棯悇検宍',
                            '偨傠'
                          ],
                          [
                            '僞宯忦審宍',
                            '偨傜'
                          ],
                          [
                            '僞宯楢梡僥宍',
                            '偰'
                          ],
                          [
                            '僞宯楢梡僞儕宍',
                            '偨傝'
                          ],
                          [
                            '僞宯楢梡僠儍宍',
                            '偪傖'
                          ],
                          [
                            '壒曋忦審宍',
                            '傝傖'
                          ],
                          [
                            '暥岅柦椷宍',
                            '傛'
                          ]
                        ],
          '彆摦帉偦偆偩宆' => [
                                {
                                  '僨僗楍婎杮宍' => 5,
                                  '岅姴' => 1,
                                  '僟楍僞宯楢梡僥宍' => 3,
                                  '僨傾儖楍婎杮宍' => 4,
                                  '婎杮宍' => 2
                                },
                                [
                                  '岅姴',
                                  '*'
                                ],
                                [
                                  '婎杮宍',
                                  '偩'
                                ],
                                [
                                  '僟楍僞宯楢梡僥宍',
                                  '偱'
                                ],
                                [
                                  '僨傾儖楍婎杮宍',
                                  '偱偁傞'
                                ],
                                [
                                  '僨僗楍婎杮宍',
                                  '偱偡'
                                ]
                              ],
          '巕壒摦帉儔峴' => [
                              {
                                '僞宯楢梡僠儍宍' => 16,
                                '僞宍' => 10,
                                '婎杮楢梡宍' => 8,
                                '岅姴' => 1,
                                '僞宯楢梡僞儕宍' => 15,
                                '柦椷宍' => 6,
                                '僞宯徣棯悇検宍' => 12,
                                '僞宯楢梡僥宍' => 14,
                                '僞愙楢梡宍' => 9,
                                '徣棯堄巙宍' => 5,
                                '僞宯悇検宍' => 11,
                                '婎杮忦審宍' => 7,
                                '枹慠宍' => 3,
                                '婎杮宍' => 2,
                                '壒曋忦審宍' => 17,
                                '堄巙宍' => 4,
                                '僞宯忦審宍' => 13
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '傞'
                              ],
                              [
                                '枹慠宍',
                                '傜'
                              ],
                              [
                                '堄巙宍',
                                '傠偆'
                              ],
                              [
                                '徣棯堄巙宍',
                                '傠'
                              ],
                              [
                                '柦椷宍',
                                '傟'
                              ],
                              [
                                '婎杮忦審宍',
                                '傟偽'
                              ],
                              [
                                '婎杮楢梡宍',
                                '傝'
                              ],
                              [
                                '僞愙楢梡宍',
                                '偭'
                              ],
                              [
                                '僞宍',
                                '偭偨'
                              ],
                              [
                                '僞宯悇検宍',
                                '偭偨傠偆'
                              ],
                              [
                                '僞宯徣棯悇検宍',
                                '偭偨傠'
                              ],
                              [
                                '僞宯忦審宍',
                                '偭偨傜'
                              ],
                              [
                                '僞宯楢梡僥宍',
                                '偭偰'
                              ],
                              [
                                '僞宯楢梡僞儕宍',
                                '偭偨傝'
                              ],
                              [
                                '僞宯楢梡僠儍宍',
                                '偭偪傖'
                              ],
                              [
                                '壒曋忦審宍',
                                '傝傖'
                              ]
                            ],
          '僫宍梕帉摿庩' => [
                              {
                                '僟楍婎杮楢梡宍' => 9,
                                '僟楍暥岅楢懱宍' => 18,
                                '僨傾儖楍僞宯楢梡僥宍' => 30,
                                '僟楍僞宯楢梡僥宍' => 15,
                                '僟楍僞宯悇検宍' => 12,
                                '僟楍柦椷宍' => 3,
                                '僟楍暥岅忦審宍' => 19,
                                '岅姴' => 1,
                                '僟楍婎杮忦審宍' => 8,
                                '僨僗楍婎杮徣棯悇検宍' => 34,
                                '僨傾儖楍婎杮悇検宍' => 22,
                                '僨傾儖楍僞宯忦審宍' => 29,
                                '僨傾儖楍婎杮徣棯悇検宍' => 23,
                                '僨傾儖楍柦椷宍' => 21,
                                '僨僗楍僞宯楢梡僥宍' => 39,
                                '僨僗楍僞宯忦審宍' => 38,
                                '僟楍僞宯楢梡僞儕宍' => 16,
                                '僨僗楍僞宯徣棯悇検宍' => 37,
                                '僨僗楍婎杮宍' => 32,
                                '僨僗楍僞宯悇検宍' => 36,
                                '僟楍僞宯忦審宍' => 14,
                                '僟楍摿庩楢懱宍' => 5,
                                '僟楍僞宍' => 11,
                                '僨傾儖楍僞宍' => 26,
                                '僨僗楍僞宯楢梡僞儕宍' => 40,
                                '僟楍婎杮悇検宍' => 6,
                                '僨傾儖楍僞宯楢梡僞儕宍' => 31,
                                '僨僗楍僞宍' => 35,
                                '僨傾儖楍婎杮宍' => 20,
                                '僟楍婎杮徣棯悇検宍' => 7,
                                '僟楍僞宯徣棯悇検宍' => 13,
                                '僟楍婎杮楢懱宍' => 4,
                                '僨傾儖楍婎杮楢梡宍' => 25,
                                '僨傾儖楍僞宯悇検宍' => 27,
                                '僟楍僞宯楢梡僕儍宍' => 17,
                                '婎杮宍' => 2,
                                '僨傾儖楍婎杮忦審宍' => 24,
                                '僟楍摿庩楢梡宍' => 10,
                                '僨僗楍婎杮悇検宍' => 33,
                                '僨傾儖楍僞宯徣棯悇検宍' => 28
                              },
                              [
                                '岅姴',
                                '*'
                              ],
                              [
                                '婎杮宍',
                                '偩'
                              ],
                              [
                                '僟楍柦椷宍',
                                '側傟'
                              ],
                              [
                                '僟楍婎杮楢懱宍',
                                '側'
                              ],
                              [
                                '僟楍摿庩楢懱宍',
                                '*'
                              ],
                              [
                                '僟楍婎杮悇検宍',
                                '偩傠偆'
                              ],
                              [
                                '僟楍婎杮徣棯悇検宍',
                                '偩傠'
                              ],
                              [
                                '僟楍婎杮忦審宍',
                                '側傜偽'
                              ],
                              [
                                '僟楍婎杮楢梡宍',
                                '偵'
                              ],
                              [
                                '僟楍摿庩楢梡宍',
                                '偔'
                              ],
                              [
                                '僟楍僞宍',
                                '偩偭偨'
                              ],
                              [
                                '僟楍僞宯悇検宍',
                                '偩偭偨傠偆'
                              ],
                              [
                                '僟楍僞宯徣棯悇検宍',
                                '偩偭偨傠'
                              ],
                              [
                                '僟楍僞宯忦審宍',
                                '偩偭偨傜'
                              ],
                              [
                                '僟楍僞宯楢梡僥宍',
                                '偱'
                              ],
                              [
                                '僟楍僞宯楢梡僞儕宍',
                                '偩偭偨傝'
                              ],
                              [
                                '僟楍僞宯楢梡僕儍宍',
                                '偠傖'
                              ],
                              [
                                '僟楍暥岅楢懱宍',
                                '側傞'
                              ],
                              [
                                '僟楍暥岅忦審宍',
                                '側傟偽'
                              ],
                              [
                                '僨傾儖楍婎杮宍',
                                '偱偁傞'
                              ],
                              [
                                '僨傾儖楍柦椷宍',
                                '偱偁傟'
                              ],
                              [
                                '僨傾儖楍婎杮悇検宍',
                                '偱偁傠偆'
                              ],
                              [
                                '僨傾儖楍婎杮徣棯悇検宍',
                                '偱偁傠'
                              ],
                              [
                                '僨傾儖楍婎杮忦審宍',
                                '偱偁傟偽'
                              ],
                              [
                                '僨傾儖楍婎杮楢梡宍',
                                '偱偁傝'
                              ],
                              [
                                '僨傾儖楍僞宍',
                                '偱偁偭偨'
                              ],
                              [
                                '僨傾儖楍僞宯悇検宍',
                                '偱偁偭偨傠偆'
                              ],
                              [
                                '僨傾儖楍僞宯徣棯悇検宍',
                                '偱偁偭偨傠'
                              ],
                              [
                                '僨傾儖楍僞宯忦審宍',
                                '偱偁偭偨傜'
                              ],
                              [
                                '僨傾儖楍僞宯楢梡僥宍',
                                '偱偁偭偰'
                              ],
                              [
                                '僨傾儖楍僞宯楢梡僞儕宍',
                                '偱偁偭偨傝'
                              ],
                              [
                                '僨僗楍婎杮宍',
                                '偱偡'
                              ],
                              [
                                '僨僗楍婎杮悇検宍',
                                '偱偟傚偆'
                              ],
                              [
                                '僨僗楍婎杮徣棯悇検宍',
                                '偱偟傚'
                              ],
                              [
                                '僨僗楍僞宍',
                                '偱偟偨'
                              ],
                              [
                                '僨僗楍僞宯悇検宍',
                                '偱偟偨傠偆'
                              ],
                              [
                                '僨僗楍僞宯徣棯悇検宍',
                                '偱偟偨傠'
                              ],
                              [
                                '僨僗楍僞宯忦審宍',
                                '偱偟偨傜'
                              ],
                              [
                                '僨僗楍僞宯楢梡僥宍',
                                '偱偟偰'
                              ],
                              [
                                '僨僗楍僞宯楢梡僞儕宍',
                                '偱偟偨傝'
                              ]
                            ]
        };

1;

=head1 MEMO

This module is generated
from F<\Utils\cygwin\usr\local\share\juman\dic\JUMAN.grammar>
and F<\Utils\cygwin\usr\local\share\juman\dic\JUMAN.katuyou>
with F<mkgrammarpm>
at Mon Aug 27 00:04:56 2007.

=cut
